<?php
function myFunction($stypef) {
	
	//var $name;

	switch($stypef){
    case "1":
      $name = "දිස්ත්‍රික් ලේකම් කාර්යාලය - මාතලේ";
	 break;
	
    case "2":
		$name= "ප්‍රාදේශීය ලේකම් කාර්යාලය - මාතලේ";
    break;
	
    case "3":
		$name= "ප්‍රාදේශීය ලේකම් කාර්යාලය - උකුවෙල";
    break;
	
	 case "4":
		$name= "ප්‍රාදේශීය ලේකම් කාර්යාලය - රත්තොට";
    break;
	
	 case "5":
		$name= "ප්‍රාදේශීය ලේකම් කාර්යාලය - අඔන්ගඟකෝරලේ";
    break;
	
	 case "6":
		$name= "ප්‍රාදේශීය ලේකම් කාර්යාලය - යටවත්ත";
    break;
	
	 case "7":
		$name= "ප්‍රාදේශීය ලේකම් කාර්යාලය - පල්ලේපොල";
    break;
	
	 case "8":
		$name= "ප්‍රාදේශීය ලේකම් කාර්යාලය -  ගලේවෙල";
    break;
	
	 case "9":
		$name= "ප්‍රාදේශීය ලේකම් කාර්යාලය - දඹුල්ල";
    break;
	
	 case "10":
		$name= "ප්‍රාදේශීය ලේකම් කාර්යාලය - නාඋල";
    break;
	
	 case "11":
		$name= "ප්‍රාදේශීය ලේකම් කාර්යාලය -  විල්ගමුව";
    break;
	
	 case "12":
		$name= "ප්‍රාදේශීය ලේකම් කාර්යාලය - ලග්ගල පල්ලේගම";
	 break;
	 
	 case "13":
		$name= "නඟර සභාව - මාතලේ";
    break;
	
	 case "14":
		$name= "නඟර සභාව - දඹුල්ල";
    break;
	
	 case "15":
		$name= "ප්‍රාදේශීය සභාව - මාතලේ";
    break;
	
	 case "16":
		$name= "ප්‍රාදේශීය සභාව - උකුවෙල";
    break;
	
	 case "17":
		$name= "ප්‍රාදේශීය සභාව - රත්තොට";
    break;
	
	case "18":
		$name= "ප්‍රාදේශීය සභාව - අඔන්ගඟකෝරලේ";
    break;
	
    case "19":
		$name= "ප්‍රාදේශීය සභාව - යටවත්ත";
    break;
	
	 case "20":
		$name= "ප්‍රාදේශීය සභාව - පල්ලේපොල";
    break;
	
	 case "21":
		$name= "ප්‍රාදේශීය සභාව -  ගලේවෙල";
    break;
	
	 case "22":
		$name= "ප්‍රාදේශීය සභාව - දඹුල්ල";
    break;
	
	 case "23":
		$name= "ප්‍රාදේශීය සභාව - නාඋල";
    break;
	
	 case "24":
		$name= "ප්‍රාදේශීය සභාව -  විල්ගමුව";
    break;
	
	 case "25":
		$name= "ප්‍රාදේශීය සභාව - ලග්ගල  පල්ලේගම";
    break;
	
	 case "26":
		$name= "පළාත් පාලන සහකාර කොමසාරිස් කාර්යාලය - මාතලේ";
    break;
	
	 case "27":
		$name= "වාරිමාර්ග ඉංජිනේරු කාර්යාලය- මාතලේ";
    break;
	
	 case "28":
		$name= "වාරිමාර්ග ඉංජිනේරු කාර්යාලය- දඹුල්ල";
	 break;
	 
	 case "29":
		$name= "ගොවිජන සංවර්ධන සහකාර කොමසාරිස් කාර්යාලය- මාතලේ";
    break;
	
	 case "30":
		$name= "අධ්‍යාපන කාර්යාලය - මාතලේ";
    break;
	
	 case "31":
		$name= "අධ්‍යාපන කාර්යාලය - නාඋල  ";
    break;
	
	 case "32":
		$name= "අධ්‍යාපන කාර්යාලය - ගලේවෙල ";
    break;
	
	 case "33":
		$name= "අධ්‍යාපන කාර්යාලය - විල්ගමුව";
    break;
	
	 case "34":
		$name= "ජේෂ්ඨ පොලිස් අධිකාරී කාර්යාලය - මාතලේ   ";
    break;
	
	case "35":
		$name= "පොලිස් අධිකාරී කාර්යාලය - දඹුල්ල";
    break;
	
    case "36":
		$name= "නියෝජ්‍ය සෞඛ්‍ය සේවා අධ්‍යක්ෂ කාර්යාලය - මාතලේ";
    break;
	
	 case "37":
		$name= "දිස්ත්‍රික් මහ රෝහල- මාතලේ";
    break;
	
	 case "38":
		$name= "අපනයන  කෘෂිකර්ම පර්යේෂණ  මධ්‍යස්ථානය - වාරියපොලවත්ත";
    break;
	
	 case "39":
		$name= "අපනයන  කෘෂිකර්ම දිස්ත්‍රික් කාර්යාලය  - ඇල්වල";
    break;
	
	 case "40":
		$name= "අපනයන  කෘෂිකර්ම පුහුණු මධ්‍යස්ථානය  - ඇල්වල";
    break;
	
	 case "41":
		$name= "නියෝජ්‍ය කෘෂිකර්ම අධ්‍යක්ෂ කාර්යාලය - මාතලේ";
    break;
	
	 case "42":
		$name= "ජේෂ්ඨ මිනින්දෝරු අධිකාරි කාර්යාලය - මාතලේ";
    break;
	
	 case "43":
		$name= "දිස්ත්‍රික් මිනින්දෝරු කාර්යාලය  - මාතලේ";
    break;
	
	 case "44":
		$name= "ප්‍රාදේශීය මිනින්දෝරු  කාර්යාලය  - නාඋල";
    break;
	
	 case "45":
		$name= "ප්‍රාදේශීය මිනින්දෝරු  කාර්යාලය  - ලග්ගල";
	 break;
	 
	 case "46":
		$name= "කාර්මික විද්‍යාලය  - මාතලේ";
    break;
	
	 case "47":
		$name= "කාර්මික විද්‍යාලය  - දඹුල්ල";
    break;
	
	 case "48":
		$name= "තැපැල් අධිකාරි කාර්යාලය - මාතලේ";
    break;
	
	 case "49":
		$name= "ඉඩම් රෙජිස්ටාර් කාර්යාලය - මාතලේ";
    break;
	
	 case "50":
		$name= "සහකාර අධ්‍යක්ෂ ඉඩම් පරිහරණ හා සැලසුම් කාර්යාලය - මාතලේ";
    break;
	
	 case "51":
		$name= "සහකාර කම්කරු කොමසාරිස්  කාර්යාලය - මාතලේ";
    break;
	
	case "52":
		$name= "සහකාර කම්කරු කොමසාරිස්  කාර්යාලය -නාඋල";
    break;
	
    case "53":
		$name= "දිසාවන කාර්යාලය - මාතලේ";
    break;
	
	 case "54":
		$name= "මෝටර් රථ පරීක්ෂක කාර්යාලය - මාතලේ";
    break;
	
	 case "55":
		$name= "දිස්ත්‍රික් උසාවිය - මාතලේ";
    break;
	
	 case "56":
		$name= "කම්කරු උසාවිය - මාතලේ";
    break;
	
	 case "57":
		$name= "සුරාබදු කාර්යාලය - මාතලේ";
    break;
	
	 case "58":
		$name= "දේශීය ආදායම් බදු කාර්යාලය - මාතලේ";
    break;
	
	 case "59":
		$name= "ශ්‍රී සංඝමිත්තා බාලිකා ජාතික පාසල";
    break;
	
	 case "60":
		$name= "මා/ ශාන්ත තෝමස් විද්‍යාලය";
    break;
	
	 case "61":
		$name= "ක්‍රිස්තුදේව ජාතික පාසල";
    break;
	
	 case "62":
		$name= "රජයේ විද්‍යා විද්‍යාලය";
	 break;
	 
	 case "63":
		$name= "විජය විද්‍යාලය";
    break;
	
	 case "64":
		$name= "මප/මා/රත්/ ඕවල විද්‍යාලය";
    break;
	
	 case "65":
		$name= "අලුත්ගම ප්‍රාථමික විද්‍යාලය";
    break;
	
	 case "66":
		$name= "ආමීනා බාලිකා විද්‍යාලය";
    break;
	
	 case "67":
		$name= "පාක්ක්‍යම්  විද්‍යාලය";
    break;
	
	
	 case "68":
		$name= "හින්දු විද්‍යාලය";
    break;
	
	case "69":
		$name= "විල්ගමුව  ප්‍රාථමික විද්‍යාලය";
    break;
	
    case "70":
		$name= "අල් මිනා ප්‍රාථමික විද්‍යාලය";
    break;
	
	 case "71":
		$name= "අජ්මීර් ජාතික පාසල";
    break;
	
	 case "72":
		$name= "ඉස්මලියා විද්‍යාලය";
    break;
	
	 case "73":
		$name= "ශ්‍රී නාග ජාතික පාසල";
    break;
	
	 case "74":
		$name= "සහිරා විද්‍යාලය";
    break;
	
	 case "75":
		$name= "සරත් ඒකනායක ආදර්ශ විද්‍යාලය";
    break;
	
	 case "76":
		$name= "වීර කැප්පැටිපොළ ජාතික පාසල";
    break;
	
	 case "77":
		$name= "මහාබෝධි ජාතික පාසල";
    break;
	
	 case "78":
		$name= "මදීනා ජාතික පාසල";
    break;
	
	 case "79":
		$name= "දඹුල්ල මධ්‍ය මහ විද්‍යාලය";
    break;
	
    default:
		$name = "welcome !";
	break;
  }
	
  return $name;
}
?>
